paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_cwdm4_202_drv.c
	//cwdm4_206_txcdr_gn2105_i2c_write_byte(0x013,0x00); 
	//cwdm4_206_txcdr_gn2105_i2c_write_byte(0x014,0x00); 
	//cwdm4_206_txcdr_gn2105_i2c_write_byte(0x015,0x00);	 //L*_DRV_PD_CTRL_REG_0
	//cwdm4_206_txcdr_gn2105_i2c_write_byte(0x115,0x00); 
	//cwdm4_206_txcdr_gn2105_i2c_write_byte(0x215,0x00); 
	//cwdm4_206_txcdr_gn2105_i2c_write_byte(0x315,0x00); 

	cwdm4_202_txcdr_gn2105_i2c_write_byte(0x84,0x01);  // bias enable
	cwdm4_202_txcdr_gn2105_i2c_write_byte(0x184,0x01);	
	cwdm4_202_txcdr_gn2105_i2c_write_byte(0x284,0x01);	
	cwdm4_202_txcdr_gn2105_i2c_write_byte(0x384,0x01);	
	
	//cwdm4_206_txcdr_gn2105_i2c_write_byte(0x40a,0x39);  
	//cwdm4_206_txcdr_gn2105_i2c_write_byte(0x545,0x80);  
	//cwdm4_206_txcdr_gn2105_i2c_write_byte(0x546,0xff);  
	
	cwdm4_202_txcdr_gn2105_i2c_write_byte(0x01c,0x02);	 //L*_DRV_IMON_CTRL
	cwdm4_202_txcdr_gn2105_i2c_write_byte(0x11c,0x02);
	cwdm4_202_txcdr_gn2105_i2c_write_byte(0x21c,0x02);
	cwdm4_202_txcdr_gn2105_i2c_write_byte(0x31c,0x02);

	cwdm4_202_txcdr_gn2105_i2c_write_byte(0x01b,0x00);	 //L*L*_DRV_PD_MON_REG_0
	cwdm4_202_txcdr_gn2105_i2c_write_byte(0x11b,0x00);
	cwdm4_202_txcdr_gn2105_i2c_write_byte(0x21b,0x00);
	cwdm4_202_txcdr_gn2105_i2c_write_byte(0x31b,0x00);


	cwdm4_202_txcdr_gn2105_i2c_write_byte(0x082,0x00);	// bias override
	cwdm4_202_txcdr_gn2105_i2c_write_byte(0x083,0x00);	
	cwdm4_202_txcdr_gn2105_i2c_write_byte(0x182,0x00);	
	cwdm4_202_txcdr_gn2105_i2c_write_byte(0x183,0x00); 
	cwdm4_202_txcdr_gn2105_i2c_write_byte(0x282,0x00);	
	cwdm4_202_txcdr_gn2105_i2c_write_byte(0x283,0x00); 
	cwdm4_202_txcdr_gn2105_i2c_write_byte(0x382,0x00);	
	cwdm4_202_txcdr_gn2105_i2c_write_byte(0x383,0x00); 

}

static void cwdm4_202_rxcdr_m37046_reset()
{
	cwdm4_202_rxcdr_m37046_i2c_write_byte(0x02, 0xaa);
	Soft_timer_delay_ms(100);
	cwdm4_202_rxcdr_m37046_i2c_write_byte(0x02, 0x00);
}

#if defined(HW_VER_AM1_202)

static float cwdm4_202_get_gn2105_bias(uint8_t channel)
{
	uint8_t lane_low = 0, lane_high = 0;
	uint16_t  channel_reg[] = {0x071, 0x171, 0x271, 0x371};
	float Ibias = 0;
	cwdm4_202_txcdr_gn2105_i2c_read_byte(channel_reg[channel], &lane_low);
	cwdm4_202_txcdr_gn2105_i2c_read_byte(channel_reg[channel + 1], &lane_high); //bit9 8

	Ibias  = lane_low | ((lane_high & 0x03) << 8);
	return Ibias;
}

#endif

#if defined(HW_VER_AM2_202)

static float cwdm4_202_get_gn2105_bias(uint8_t channel)
{
	uint8_t lane_low, lane_high, RPP = 0;
	uint16_t  channel_reg[] = {0x070, 0x170, 0x270, 0x370};
	float Ibias = 0;
	cwdm4_202_txcdr_gn2105_i2c_read_byte(0x465, &RPP);
	cwdm4_202_txcdr_gn2105_i2c_read_byte(channel_reg[channel], &lane_low);
	cwdm4_202_txcdr_gn2105_i2c_read_byte(channel_reg[channel] + 1, &lane_high); //bit9 8
	Ibias  = lane_low | ((lane_high & 0x0F) << 8);
	Ibias = Ibias / (4095 * 8.774 * (1.145845 - 0.00463 * RPP))*1000*10;   //0.1mA
	return Ibias;
}

static uint16_t cwdm4_202_ddmi_get_txmon(uint8_t channel)
{
	uint8_t txmon_lo, txmon_hi,  RPP = 0;
	uint16_t  channel_reg[] = {0x076, 0x176, 0x276, 0x376};
	float txmon = 0;
	cwdm4_202_txcdr_gn2105_i2c_read_byte(0x465, &RPP);
	cwdm4_202_txcdr_gn2105_i2c_read_byte(channel_reg[channel], &txmon_lo);
	cwdm4_202_txcdr_gn2105_i2c_read_byte(channel_reg[channel] + 1, &txmon_hi); //bit9 8
	txmon  = txmon_lo | ((txmon_hi & 0x03) << 8);
	txmon = (txmon / (1023 * 394.1 * (1.145845 - 0.00463 * RPP)))*1000*10;   //0.1mA
	return txmon;
}

#endif

static float cwdm4_202_ddmi_get_rssi(uint8_t channel)
{
	uint16_t rssi_mv = 0;
	rssi_mv =  ADC0_get_rssi(channel);
	return (float)rssi_mv / (float)RSSI_SERIES_RES * 1000.00;  //uA}
}

static void  cwdm4_202_drv_check_laser_ch(SFP_DRV_LASER_CFG_T *cfg)
{
	if(cfg->bias > 40)
	{
		cfg->bias = 40;
	}
	if(cfg->mod > 80)
	{
		cfg->mod = 80;
	}
}

static int8_t cwdm4_202_crossing_dac_tranfer_cross_lut(uint8_t cross)
{
	uint8_t value = 0;

	if(cross >= 0x0 && cross <= 0x7)
	{
		value = cross;
	}
	else if(cross >= 0x8 && cross <= 0x15)
	{
		value = cross - 16;
	}
	return (int8_t)value;
}

static uint8_t cwdm4_202_crossing_value_handle(int16_t crossing)
{
	uint8_t value = 0;

	if(crossing >= 0x0 && crossing <= 7)
	{
		value = crossing;
	}
	else if(crossing > 7)
	{
		value = 7;  //max value
	}
	else if(crossing < -9)
	{
		value = 8;   //min value
	}
	else
	{
		value = crossing + 16;
	}
	return value;
}


//***********************************************public function***************************************8

void CWDM4_202_chip_reset(void)
{
	cwdm4_202_txcdr_gn2105_reset();
	cwdm4_202_rxcdr_m37046_reset();
}

void CWDM4_202_port_init(void)// mcu_port_init
{
#if defined(HW_VER_AM1_202)

	cwdm4_201_port0_init();
	cwdm4_201_port1_init();
	cwdm4_201_port2_init();
	cwdm4_201_port3_init();		
		
#endif

#if defined(HW_VER_AM2_202)

	cwdm4_202_port0_init();
	cwdm4_202_port1_init();
	cwdm4_202_port2_init();
	cwdm4_202_port3_init();	
#endif
	//return ;
}

void CWDM4_202_chip_init(void)		// init
{
	CWDM4_202_chip_reset();
	cwdm4_202_txcdr_gn2105_init();
}

int16_t CWDM4_202_ddmi_get_temp(MSA_DRV_VAL_TYPE type)
{
	if(type == MSA_DRV_VAL_NORM)
	{
		DDMI_CALI_PARA_T *ddmi_cali = MSA_p67_get_ddmi_cali_cfg();
		return (ddmi_cali->temp + ADC0_get_mcu_temp()); 		//MSA format uint: 1/256 C
	}
	else if(type == MSA_DRV_VAL_HW)
	{
		return  ((int16_t)ADC0_get_mcu_temp());  //MSA format uint:1/256ÉãÊÏ¶È
	}

	return GOS_FAIL;
}

uint16_t CWDM4_202_ddmi_get_vcc(MSA_DRV_VAL_TYPE type)
{
	if(type == MSA_DRV_VAL_NORM)
	{
		const DDMI_CALI_PARA_T *ddmi_cali = MSA_p67_get_ddmi_cali_cfg();
		return (ddmi_cali->vcc + ADC0_get_vcc()); //uint:0.1mv
	}
	else if(type == MSA_DRV_VAL_HW)
	{
		return (uint16_t)(floor(0.5 + ADC0_get_vcc()));  //uint:mV
	}

	return GOS_FAIL;
}

uint16_t CWDM4_202_ddmi_get_bias(uint8_t channel, MSA_DRV_VAL_TYPE type)
{
	if(type == MSA_DRV_VAL_NORM)
	{
		DDMI_CALI_PARA_T *ddmi_cali = MSA_p67_get_ddmi_cali_cfg();
		const MSA_LUT_T  *laser_stat = MSA_p4_get_laser_state();
		return ((ddmi_cali->current[0].bias.bias_offset1 + laser_stat->ch[channel].stat.txbias) >> 1);
	}
	else if(type == MSA_DRV_VAL_HW)
	{
		return (uint16_t)(cwdm4_202_get_gn2105_bias(channel));
	}
	return GOS_FAIL;
}

