paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_cwdm4_202_drv.c
uint16_t CWDM4_202_ddmi_get_rx_power(uint8_t channel, MSA_DRV_VAL_TYPE type)
{
	if(type == MSA_DRV_VAL_NORM)
	{
		float rxpower_result = 0.0 ,rxpower1 = 0.0, rxpower2 = 0.0, rssi1 = 0.0, rssi2 = 0.0;
		const DDMI_CALI_PARA_T *ddmi_cali = MSA_p67_get_ddmi_cali_cfg();
		const MSA_LUT_T 		*laser_stat = MSA_p4_get_laser_state();

		//ddmi_cali->tx_rx_pwr[channel].rxpower.rxpower1 uint:0.1uw
		rxpower1 = (float)ddmi_cali->current[channel].rxpower.rxpower1 * 0.1 / 1000.0;  //uint:mW
		rxpower2 = (float)ddmi_cali->current[channel].rxpower.rxpower2 * 0.1 / 1000.0;  //uint:mW

		//ddmi_cali->tx_rx_pwr[channel].rxpower.rssi1 uint:uA
		rssi1 	 = (float)ddmi_cali->current[channel].rxpower.rssi1;
		rssi2 	 = (float)ddmi_cali->current[channel].rxpower.rssi2;

		if(rssi2 != rssi1)
		{
			  rxpower_result = rxpower1 + ((float)laser_stat->ch[channel].stat.rssi - rssi1) * ((rxpower2 - rxpower1) / (rssi2 - rssi1));  //uint: mW
		}

		CHECK_POWER_MIN(rxpower_result);
		CHECK_POWER_MAX(rxpower_result);
		return (uint16_t)(rxpower_result * 10.0 * 1000.0);  //MSA format uint:0.1uW
}
	else if(type == MSA_DRV_VAL_HW)
	{
		return  (uint16_t)cwdm4_202_ddmi_get_rssi(channel);  //uint:ua
	}

	return GOS_FAIL;
}

uint16_t CWDM4_202_ddmi_get_tx_power(uint8_t channel, MSA_DRV_VAL_TYPE type)
{
	if(type == MSA_DRV_VAL_NORM)
	{
		float bias_rt_ma = 0.0, bias_ct_ma = 0.0, bias_N = 0.0;
		float txpower_result = 0.0, txpower1 = 0.0, txpower2 = 0.0, bias1 = 0.0, bias2 = 0.0;
		const DDMI_CALI_PARA_T    *ddmi_cali = MSA_p67_get_ddmi_cali_cfg();
		const MSA_LUT_T 		  *laser_stat = MSA_p4_get_laser_state();
		const SFP_DRV_LASER_CFG_T *lo_cfg = (SFP_DRV_LASER_CFG_T *)MSA_p67_get_drv_lut();
		const SFP_DRV_LASER_CFG_T *m_cfg  = (lo_cfg + MSA_CHANNEL_NUM);

		bias_rt_ma = 4.0 + 0.1 * (float)((m_cfg + channel)->bias);  					//bias dac value tranfer to bias current

		bias_ct_ma = 4.0 + 0.1 * (float)laser_stat->ch[channel].config.bias;    //bias dac value tranfer to bias current

		//laser_stat->ch[channel].stat.txpwr uint:0.1mA
		bias_N = bias_rt_ma - (bias_ct_ma - (float)laser_stat->ch[channel].stat.txpwr * 0.1);

		//ddmi_cali->tx_rx_pwr[channel].txpower.txpower uint:0.1uw
		txpower1 = (float)ddmi_cali->current[channel].txpower.txpower1 * 0.1 / 1000.0; //uint:mW
		txpower2 = (float)ddmi_cali->current[channel].txpower.txpower2 * 0.1 / 1000.0; //uint:mW

		//ddmi_cali->tx_rx_pwr[channel].txpower.bias uint:0.1mA
		bias1 = (float)ddmi_cali->current[channel].txpower.bias1 * 0.1; //uint:mA
		bias2 = (float)ddmi_cali->current[channel].txpower.bias2 * 0.1; //uint:mA

		if(bias1 != bias2)
		{
			txpower_result = txpower1 + (txpower1 - txpower2)/(bias1 - bias2) * (bias_N - bias1);  //uint:mW
		}

		CHECK_POWER_MIN(txpower_result);
		CHECK_POWER_MAX(txpower_result);
		return (uint16_t)(txpower_result * 1000.0 * 10.0); //MSA format uint:0.1uW

	}
	else if(type == MSA_DRV_VAL_HW)
	{
		return (uint16_t)(cwdm4_202_ddmi_get_txmon(channel)); //uint:0.1mA
	}
	return GOS_FAIL;
}

#if defined(HW_VER_AM1_202)

void CWDM4_202_drv_adjust_laser_ch(uint8_t ch, SFP_DRV_LASER_CFG_T *cfg)
{
	static code uint16_t bias_reg[]	= {0x082, 0x182, 0x282, 0x382};
	static code uint16_t mod_reg[]	= {0x085, 0x185, 0x285, 0x385};
	static code uint16_t cross_reg[] = {0x023, 0x123, 0x223, 0x323};

	cfg->cross = cwdm4_202_crossing_value_handle(cfg->cross);

	cwdm4_202_txcdr_gn2105_i2c_write_byte(bias_reg[ch], (uint8_t)(cfg->bias & 0xFF) );
	cwdm4_202_txcdr_gn2105_i2c_write_byte(bias_reg[ch] + 1, (uint8_t)((cfg->bias >> 8) & 0x03) );
	cwdm4_202_txcdr_gn2105_i2c_write_byte(mod_reg[ch], (uint8_t)(cfg->mod & 0xFF));
	cwdm4_202_txcdr_gn2105_i2c_write_byte(mod_reg[ch] + 1, (uint8_t)((cfg->mod >> 8) & 0x03));
	cwdm4_202_txcdr_gn2105_i2c_write_byte(cross_reg[ch], (uint8_t)(cfg->cross & 0x1F));
	cwdm4_202_txcdr_gn2105_i2c_write_byte(cross_reg[ch] + 1, (uint8_t)((cfg->cross >> 8) & 0x1F));

}

void CWDM4_202_drv_get_laser_full_state(uint8_t channel, MSA_LUT_T *lut)
{
	static code uint16_t bias_reg[]	= {0x082, 0x182, 0x282, 0x382};
	static code uint16_t mod_reg[]	= {0x085, 0x185, 0x285, 0x385};
	static code uint16_t cross_reg[] = {0x023, 0x123, 0x223, 0x323};

	uint8_t bias_low, mod_low, cross_low;
	uint8_t bias_high, mod_high, cross_high;

	lut->temp = DDM_GET_TEMP(MSA_DRV_VAL_HW);

	cwdm4_202_txcdr_gn2105_i2c_read_byte(bias_reg[channel],  &bias_low);
	cwdm4_202_txcdr_gn2105_i2c_read_byte(bias_reg[channel] + 1,  &bias_high);
	cwdm4_202_txcdr_gn2105_i2c_read_byte(mod_reg[channel],	 &mod_low);
	cwdm4_202_txcdr_gn2105_i2c_read_byte(mod_reg[channel] + 1,	 &mod_high);
	cwdm4_202_txcdr_gn2105_i2c_read_byte(cross_reg[channel], &cross_low);
	cwdm4_202_txcdr_gn2105_i2c_read_byte(cross_reg[channel] + 1, &cross_high);

	lut->ch[channel].config.bias = (uint16_t)(bias_low | (bias_high & 0x03) << 8);
	lut->ch[channel].config.mod  = (uint16_t)(mod_low | (mod_high & 0x03) << 8);
	//lut->ch[channel].config.cross = (uint16_t)((cross_low & 0x1F) | (cross_high & 0x1F) << 8);
	lut->ch[channel].config.cross = cwdm4_202_crossing_dac_tranfer_cross_lut((cross_low & 0x1F) | (cross_high & 0x1F) << 8);
}

#endif

#if defined(HW_VER_AM2_202) // for GN2105B

void CWDM4_202_drv_adjust_laser_ch(uint8_t ch, SFP_DRV_LASER_CFG_T *cfg)
{
	static code uint16_t bias_reg[]	= {0x082, 0x182, 0x282, 0x382};
	static code uint16_t mod_reg[]	= {0x085, 0x185, 0x285, 0x385};
	static code uint16_t cross_reg[] = {0x023, 0x123, 0x223, 0x323};

	cfg->cross = cwdm4_202_crossing_value_handle(cfg->cross);

	cwdm4_202_txcdr_gn2105_i2c_write_byte(bias_reg[ch], (uint8_t)(cfg->bias & 0xFF) );
	cwdm4_202_txcdr_gn2105_i2c_write_byte(bias_reg[ch + 1], (uint8_t)((cfg->bias >> 8) & 0x03) );
	cwdm4_202_txcdr_gn2105_i2c_write_byte(mod_reg[ch], (uint8_t)(cfg->mod & 0xFF));
	cwdm4_202_txcdr_gn2105_i2c_write_byte(mod_reg[ch + 1], (uint8_t)((cfg->mod >> 8) & 0x03));
	cwdm4_202_txcdr_gn2105_i2c_write_byte(cross_reg[ch], (uint8_t)(cfg->cross & 0x1F));
	cwdm4_202_txcdr_gn2105_i2c_write_byte(cross_reg[ch + 1], (uint8_t)((cfg->cross >> 8) & 0x1F));

	return ;
}

void CWDM4_202_drv_get_laser_full_state(uint8_t channel, MSA_LUT_T *lut)
{
	static code uint16_t bias_reg[]	= {0x082, 0x182, 0x282, 0x382};
	static code uint16_t mod_reg[]	= {0x085, 0x185, 0x285, 0x385};
	static code uint16_t cross_reg[] = {0x023, 0x123, 0x223, 0x323};

	uint8_t bias_low, mod_low, cross_low;
	uint8_t bias_high, mod_high, cross_high;

