paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_cwdm4_202_drv.c
	lut->temp = DDM_GET_TEMP(MSA_DRV_VAL_HW);

	cwdm4_202_txcdr_gn2105_i2c_read_byte(bias_reg[channel],  &bias_low);
	cwdm4_202_txcdr_gn2105_i2c_read_byte(bias_reg[channel + 1],  &bias_high);
	cwdm4_202_txcdr_gn2105_i2c_read_byte(mod_reg[channel],	 &mod_low);
	cwdm4_202_txcdr_gn2105_i2c_read_byte(mod_reg[channel + 1],	 &mod_high);
	cwdm4_202_txcdr_gn2105_i2c_read_byte(cross_reg[channel], &cross_low);
	cwdm4_202_txcdr_gn2105_i2c_read_byte(cross_reg[channel + 1], &cross_high);

	lut->ch[channel].config.bias = (uint16_t)(bias_low | (bias_high & 0x03) << 8);
	lut->ch[channel].config.mod  = (uint16_t)(mod_low | (mod_high & 0x03) << 8);
//	lut->ch[channel].config.cross = (uint16_t)((cross_low & 0x1F) | (cross_high & 0x1F) << 8);
	lut->ch[channel].config.cross = cwdm4_202_crossing_dac_tranfer_cross_lut((cross_low & 0x1F) | (cross_high & 0x1F) << 8);
	return ;
}

#endif

void CWDM4_202_drv_ch_calc_cfg (int16_t cur_temp, uint8_t ch, const SFP_DRV_LASER_CFG_T *lut, SFP_DRV_LASER_CFG_T *ret)
{
	SFP_DRV_LASER_CFG_T *lo_cfg = (lut + ch);
	SFP_DRV_LASER_CFG_T *m_cfg	= (lo_cfg + MSA_CHANNEL_NUM);
	SFP_DRV_LASER_CFG_T *hi_cfg = (m_cfg + MSA_CHANNEL_NUM);

	ret->temp = cur_temp;
	if (cur_temp <= m_cfg->temp)
	{
		ret->bias = (uint16_t )(floor(0.5 + (double)lo_cfg->bias +
						((double)(cur_temp - lo_cfg->temp)) * ((double)(m_cfg->bias - lo_cfg->bias))
						/ ((double)(m_cfg->temp - lo_cfg->temp))));
		ret->mod = (uint16_t)(floor(0.5 + (double)lo_cfg->mod +
						((double)(cur_temp - lo_cfg->temp)) * ((double)(m_cfg->mod - lo_cfg->mod))
						/ ((double)(m_cfg->temp - lo_cfg->temp))));
		ret->cross = (int16_t)(floor(0.5 + (double)lo_cfg->cross +
						((double)(cur_temp - lo_cfg->temp)) * ((double)(m_cfg->cross - lo_cfg->cross))
						/ ((double)(m_cfg->temp - lo_cfg->temp))));
	}
	else
	{
		ret->bias = (uint16_t)(floor(0.5 + (double)m_cfg->bias * exp(
						((double)(cur_temp - m_cfg->temp))
						* log(((double)hi_cfg->bias)/((double)m_cfg->bias))
						/ ((double)(hi_cfg->temp - m_cfg->temp)))));
		ret->mod  = (uint16_t)(floor(0.5 + (double)m_cfg->mod * exp(
						((double)(cur_temp-m_cfg->temp))
						* log(((double)hi_cfg->mod)/((double)m_cfg->mod))
						/ ((double)(hi_cfg->temp - m_cfg->temp)))));
		ret->cross = (int16_t)(floor(0.5 + (double)m_cfg->cross +
						((double)(cur_temp - m_cfg->temp)) * ((double)(hi_cfg->cross - m_cfg->cross))
						/ ((double)(hi_cfg->temp - m_cfg->temp))));
		}
		cwdm4_202_drv_check_laser_ch(ret);
	return ;
}

void CWDM4_202_drv_poll(void)
{
	ADC0_poll();
	return ;
}

void CWDM4_202_set_low_power(uint8_t enable)
{
	if(enable)
	{
		IT01CF &= ~IT01CF_IN0PL__ACTIVE_HIGH;
		TX3V3_EN = 0;  //close tx3v3 in order to realize low power mode
	}
	else
	{
		MSA_set_low_power_mode(1);
		IT01CF |= IT01CF_IN0PL__ACTIVE_HIGH;
		TX3V3_EN = 1; //open tx3v3 in order to realize high power mode
	}

}

void CWDM4_202_set_tx_enable(uint8_t enale)
{
	uint8_t value = 0;
	cwdm4_202_txcdr_gn2105_i2c_read_byte(0x433,&value);
	value = CLEAR_LSB_4BITS(value)|CLEAR_MSB_4BITS(enale);
	cwdm4_202_txcdr_gn2105_i2c_write_byte(0x433, value);
	cwdm4_202_txcdr_gn2105_i2c_read_byte(0x433,&value);
}


MSA_INTR_STATUS_T *CWDM4_202_get_drv_intr_status(uint8_t intr_mask)
{
	static MSA_INTR_STATUS_T status;
	uint8_t value = 0;

	if(intr_mask & PORT_INTR_TX_FAULT)
	{
		cwdm4_202_txcdr_gn2105_i2c_read_byte(0x437, &value);  //get tx fault
		status.tx_fault = (value & 0x0F);
	}
	if(intr_mask & PORT_INTR_TX_LOS)
	{
		cwdm4_202_txcdr_gn2105_i2c_read_byte(0x413, &value);  //get tx los  
		status.tx_los = (value & 0x0F);
	}
	if(intr_mask & PORT_INTR_TX_LOL)
	{
		cwdm4_202_txcdr_gn2105_i2c_read_byte(0x413, &value);  //get tx lol  
		status.tx_lol = (value & 0xF0);
	}
	if(intr_mask & PORT_INTR_RX_LOL)
	{
		cwdm4_202_rxcdr_m37046_i2c_read_byte(0x14, &value);  //get rx lol 
		status.rx_lol = (value & 0xF0) >> 4;
	}	
	if(intr_mask & PORT_INTR_RX_LOS)
	{
		cwdm4_202_rxcdr_m37046_i2c_read_byte(0x14, &value);  //get rx los 
		status.rx_los = (value & 0x0F);
	}
	return &status;

}


void CWDM4_202_set_cdr_control(uint8_t value)
{
	value = 0;
}

void CWDM4_202_set_tx_eq(uint8_t channel, uint8_t value)
{
	channel = value = 0;
}

void CWDM4_202_set_rx_emphasis(uint8_t channel, uint8_t value)
{
	channel = value = 0;
}

void CWDM4_202_set_rx_amplitude(uint8_t channel, uint8_t value)
{
	channel = value = 0;
}

void CWDM4_202_set_cdr_sq_disable(uint8_t value)
{
	value = 0;
}

void CWDM4_202_set_rx_output_disable(uint8_t value)
{
	value = 0;
}

void CWDM4_202_set_tx_adapt_eq(uint8_t value1, uint8_t value2, uint8_t value3)
{
	value1 = value2 = value3 = 0;
}


#endif
